cases/Bent_pipe_Shape_Effect/Shape_1.5/system/solverInfo

// -*- C++ -*-

#includeEtc "caseDicts/postProcessing/numerical/solverInfo.cfg"

fields      ( p U rho);


// ************************************************************************* //
